Revit 2024 API
BoundingBoxXYZ Constructor
Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public BoundingBoxXYZ()
Visual Basic
Public Sub New
Visual C++
public:
BoundingBoxXYZ()
See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace